{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. \n",
    "В случае с английским алфавитом очки распределяются так:\n",
    "\n",
    "• A, E, I, O, U, L, N, S, T, R – 1 очко;\n",
    "• D, G – 2 очка;\n",
    "• B, C, M, P – 3 очка;\n",
    "• F, H, V, W, Y – 4 очка;\n",
    "• K – 5 очков;\n",
    "• J, X – 8 очков;\n",
    "• Q, Z – 10 очков.\n",
    "\n",
    "А русские буквы оцениваются так:\n",
    "\n",
    "• А, В, Е, И, Н, О, Р, С, Т – 1 очко;\n",
    "• Д, К, Л, М, П, У – 2 очка;\n",
    "• Б, Г, Ё, Ь, Я – 3 очка;\n",
    "• Й, Ы – 4 очка;\n",
    "• Ж, З, Х, Ц, Ч – 5 очков;\n",
    "• Ш, Э, Ю – 8 очков;\n",
    "• Ф, Щ, Ъ – 10 очков.\n",
    "\n",
    "Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы. Любая последовательность букв считается словом.\n",
    "\n",
    "Пример ввода:\n",
    "ноутбук\n",
    "Пример вывода:\n",
    "12 "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# словари\n",
    "eng = {\n",
    "    'A': 1, 'E': 1, 'I': 1, 'O': 1, 'U': 1, 'L': 1, 'N': 1, 'S': 1, 'T': 1, 'R': 1,\n",
    "    'D': 2, 'G': 2,\n",
    "    'B': 3, 'C': 3, 'M': 3, 'P': 3,\n",
    "    'F': 4, 'H': 4, 'V': 4, 'W': 4, 'Y': 4,\n",
    "    'K': 5,\n",
    "    'J': 8, 'X': 8,\n",
    "    'Q': 10, 'Z': 10\n",
    "}\n",
    "\n",
    "rus = {\n",
    "    'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1,\n",
    "    'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2,\n",
    "    'Б': 3, 'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3,\n",
    "    'Й': 4, 'Ы': 4,\n",
    "    'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5,\n",
    "    'Ш': 8, 'Э': 8, 'Ю': 8,\n",
    "    'Ф': 10, 'Щ': 10, 'Ъ': 10\n",
    "}\n",
    "# проверка\n",
    "def valid(word):\n",
    "    word = word.upper()  # регистр\n",
    "    if all(char in eng for char in word):  \n",
    "        return 'english'\n",
    "    elif all(char in rus for char in word):  \n",
    "        return 'russian'\n",
    "    else:\n",
    "        return False\n",
    "\n",
    "# считаем\n",
    "def calc(word):\n",
    "    word = word.upper()  # регистр\n",
    "    if valid(word)== 'english': \n",
    "        lang = eng\n",
    "    else: \n",
    "        lang = rus\n",
    "    \n",
    "    score = 0\n",
    "    for char in word:\n",
    "        score += lang[char] \n",
    "    return score\n",
    "\n",
    "word = input(\"введите слово: \")\n",
    "\n",
    "if not valid(word):\n",
    "    print(\"слово должно содержать только русские или только английские буквы\")\n",
    "else:\n",
    "    # Выводим результат\n",
    "    print(f\"стоимость слова '{word}': {calc(word)} очков\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
